Revit 2026 API

# HVACLoadLoadsReportType Enumeration

---

Enumerated type listing possible types of reports generated for HVAC loads.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum HVACLoadLoadsReportType
```
```vb
Public Enumeration HVACLoadLoadsReportType
```
```cpp
public enum class HVACLoadLoadsReportType
```
```fsharp
type HVACLoadLoadsReportType
```

| Member name | Value | Description |
| --- | --- | --- |
| DetailedReport | 3 | A detailed report including orientation breakdowns |
| NoReport | 0 | No report |
| SimpleReport | 1 | A simple report with summaries |
| StandardReport | 2 | A standard report including zones and spaces |

#### Reference

Autodesk.Revit.DB.Analysis Namespace